In [105]:
# Dependancies
import pandas as pd, requests, json
import os
import csv

# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect, func

# Import modules to declare columns and column data types
from sqlalchemy import Column, Integer, String, Float

# Import and establish Base for which classes will be constructed 
from sqlalchemy.ext.declarative import declarative_base

# Define Declarative Base 
Base = declarative_base()

# Library OpenCageGeocode => to get lats and longs for each country
from opencage.geocoder import OpenCageGeocode

In [39]:
# Creating an engine, sqlite database and connection to the engine
engine = create_engine("sqlite:///db/wine.sqlite", echo=False)
conn = engine.connect()

In [45]:
# Use this to delete tables
# engine.execute('DROP TABLE map_wine_table')

# Clear the metadata object, too
# Base.metadata.clear()

# Inspecting the Table to make sure the table is there
# inspector = inspect(engine)
# inspector.get_table_names()

['wine_table']


# Exploratory Analysis of the Data

In [ ]:
# Read in CSV File
raw_df = pd.read_csv('db/wine_library.csv', dtype = {'Zip': 'str'})
raw_df.head(10)

In [107]:
# Inspecting the data 
# NOTE: The lowest point is 80, the highest is 100, so have to put the ratings in the range for the ml label later on
raw_df.describe()

          Unnamed: 0         points          price
count  150930.000000  150930.000000  137235.000000
mean    75464.500000      87.888418      33.131482
std     43569.882402       3.222392      36.322536
min         0.000000      80.000000       4.000000
25%     37732.250000      86.000000      16.000000
50%     75464.500000      88.000000      24.000000
75%    113196.750000      90.000000      40.000000
max    150929.000000     100.000000    2300.000000

In [54]:
# Shape of the data
raw_df.shape

(150930, 11)

In [55]:
# See if there are any NaN values
raw_df.isnull().sum()

Unnamed: 0         0
country            5
description        0
designation    45735
points             0
price          13695
province           5
region_1       25060
region_2       89977
variety            0
winery             0
dtype: int64

In [108]:
# Drop designation & region_2 columns (don't need those)
dropped_df = raw_df.drop(['designation', 'Unnamed: 0'], axis = 1) 
dropped_df.head(2)

,country,description,points,price,province,region_1,region_2,variety,winery
0,US,This tremendous 100% varietal wine hails from ...,96,235.0,California,Napa Valley,Napa,Cabernet Sauvignon,Heitz
1,Spain,"Ripe aromas of fig, blackberry and cassis are ...",96,110.0,Northern Spain,Toro,NaN,Tinta de Toro,Bodega Carmen Rodríguez

In [109]:
# Drop all NaN values in region_1 and price columns
# NOTE: if there is a missing values in region 1 then the data was entered incorrectly
# NOTE: Only dropping NaN values from country and price. If I dropped NaN values from region_2 then I only have 9 
# countries, losing too much data.
new_df = dropped_df.dropna(subset=['price', 'country'])

In [110]:
# The shape of a clean dataset 
new_df.shape

(137230, 9)

In [111]:
new_df.head(2)

,country,description,points,price,province,region_1,region_2,variety,winery
0,US,This tremendous 100% varietal wine hails from ...,96,235.0,California,Napa Valley,Napa,Cabernet Sauvignon,Heitz
1,Spain,"Ripe aromas of fig, blackberry and cassis are ...",96,110.0,Northern Spain,Toro,NaN,Tinta de Toro,Bodega Carmen Rodríguez

# Load the Data into sqlite database

In [18]:
# Creating a Class & table 
class Wine(Base):
    __tablename__ = 'wine_table'
    id = Column(Integer, primary_key=True)
    country = Column(String(255))
    description = Column(String(1000))
    points = Column(Float)
    price = Column(Float)
    province = Column(String(255))
    region_1 = Column(String(255))
    region_2 = Column(String(255))
    variety = Column(String(255))
    winery = Column(String(255))

In [19]:
Base.metadata.create_all(conn)

In [20]:
# Transfer the data to sqlite table
new_df.to_sql(name='wine_table', con=conn, if_exists='append', index=False)

In [21]:
# Inspecting the Table to make sure the table is there
inspector = inspect(engine)
inspector.get_table_names()

['wine_table']

In [22]:
# Checking the data 
engine.execute('SELECT * FROM wine_table LIMIT 20').fetchall()

[(1, 'US', 'This tremendous 100% varietal wine hails from Oakville and was aged over three years in oak. Juicy red-cherry fruit and a compelling hint of caramel  ... (57 characters truncated) ... ubtle minty tone in the background. Balanced and rewarding from start to finish, it has years ahead of it to develop further nuance. Enjoy 2022–2030.', 96.0, 235.0, 'California', 'Napa Valley', 'Napa', 'Cabernet Sauvignon', 'Heitz'),
 (2, 'Spain', 'Ripe aromas of fig, blackberry and cassis are softened and sweetened by a slathering of oaky chocolate and vanilla. This is full, layered, intense an ... (20 characters truncated) ... alate, with rich flavors of chocolaty black fruits and baking spices. A toasty, everlasting finish is heady but ideally balanced. Drink through 2023.', 96.0, 110.0, 'Northern Spain', 'Toro', None, 'Tinta de Toro', 'Bodega Carmen Rodríguez'),
 (3, 'US', 'Mac Watson honors the memory of a wine once made by his mother in this tremendously delicious, balanced and complex botrytised white. Dark gold in color, it layers toasted hazelnut, pear compote and orange peel flavors, reveling in the succulence of its 122 g/L of residual sugar.', 96.0, 90.0, 'California', 'Knights Valley', 'Sonoma', 'Sauvignon Blanc', 'Macauley'),
 (4, 'US', "This spent 20 months in 30% new French oak, and incorporates fruit from Ponzi's Aurora, Abetina and Madrona vineyards, among others. Aromatic, dense  ... (88 characters truncated) ... herry, coffee and graphite. Tannins are polished to a fine sheen, and frame a finish loaded with dark chocolate and espresso. Drink now through 2032.", 96.0, 65.0, 'Oregon', 'Willamette Valley', 'Willamette Valley', 'Pinot Noir', 'Ponzi'),
 (5, 'France', 'This is the top wine from La Bégude, named after the highest point in the vineyard at 1200 feet. It has structure, density and considerable acidity t ... (78 characters truncated) ... extra richness and concentration. Produced by the Tari family, formerly of Château Giscours in Margaux, it is a wine made for aging. Drink from 2020.', 95.0, 66.0, 'Provence', 'Bandol', None, 'Provence red blend', 'Domaine de la Bégude'),
 (6, 'Spain', 'Deep, dense and pure from the opening bell, this Toro is a winner. Aromas of dark ripe black fruits are cool and moderately oaked. This feels massive ... (17 characters truncated) ... t sensationally balanced. Flavors of blackberry, coffee, mocha and toasty oak finish spicy, smooth and heady. Drink this exemplary Toro through 2023.', 95.0, 73.0, 'Northern Spain', 'Toro', None, 'Tinta de Toro', 'Numanthia'),
 (7, 'Spain', "Slightly gritty black-fruit aromas include a sweet note of pastry along with a hint of prune. Wall-to-wall saturation ensures that all corners of one ... (21 characters truncated) ...  Flavors of blackberry, mocha and chocolate are highly impressive and expressive, while this settles nicely on a long finish. Drink now through 2024.", 95.0, 65.0, 'Northern Spain', 'Toro', None, 'Tinta de Toro', 'Maurodos'),
 (8, 'Spain', 'Lush cedary black-fruit aromas are luxe and offer notes of marzipan and vanilla. This bruiser is massive and tannic on the palate, but still lush and ... (59 characters truncated) ...  cassis flavors are hardly wallflowers. On the finish, this is tannic and deep as a sea trench. Drink this saturated black-colored Toro through 2023.', 95.0, 110.0, 'Northern Spain', 'Toro', None, 'Tinta de Toro', 'Bodega Carmen Rodríguez'),
 (9, 'US', "This re-named vineyard was formerly bottled as deLancellotti. You'll find striking minerality underscoring chunky black fruits. Accents of citrus and graphite comingle, with exceptional midpalate concentration. This is a wine to cellar, though it is already quite enjoyable. Drink now through 2030.", 95.0, 65.0, 'Oregon', 'Chehalem Mountains', 'Willamette Valley', 'Pinot Noir', 'Bergström'),
 (10, 'US', 'The producer sources from two blocks of the vineyard for this wine—one at a high elevation, which contributes bright acidity. Crunchy cranberry, pome ... (9 characters truncated) ... nd orange peel flavors surround silky, succulent layers of texture that present as fleshy fruit. That delicately lush flavor has considerable length.', 95.0, 60.0, 'California', 'Sonoma Coast', 'Sonoma', 'Pinot Noir', 'Blue Farm'),
 (11, 'Italy', "Elegance, complexity and structure come together in this drop-dead gorgeous winethat ranks among Italy's greatest whites. It opens with sublime yello ... (76 characters truncated) ... us palate seamlessly combines juicy white peach, ripe pear and citrus flavors while white almond and savory mineral notes grace the lingering finish.", 95.0, 80.0, 'Northeastern Italy', 'Collio', None, 'Friulano', 'Borgo del Tiglio'),
 (12, 'US', 'From 18-year-old vines, this supple well-balanced effort blends flavors of mocha, cherry, vanilla and breakfast tea. Superbly integrated and delicious even at this early stage, this wine seems destined for a long and savory cellar life. Drink now through 2028.', 95.0, 48.0, 'Oregon', 'Ribbon Ridge', 'Willamette Valley', 'Pinot Noir', 'Patricia Green Cellars'),
 (13, 'US', 'A standout even in this terrific lineup of 2015 releases from Patricia Green, the Weber opens with a burst of cola and tobacco scents and accents. It continues, subtle and detailed, with flavors of oranges, vanilla, tea and milk chocolate discreetly threaded through ripe blackberry fruit.', 95.0, 48.0, 'Oregon', 'Dundee Hills', 'Willamette Valley', 'Pinot Noir', 'Patricia Green Cellars'),
 (14, 'France', 'This wine is in peak condition. The tannins and the secondary flavors dominate this ripe leather-textured wine. The fruit is all there as well: dried ... (5 characters truncated) ... ies and hints of black-plum skins. It is a major wine right at the point of drinking with both the mature flavors and the fruit in the right balance.', 95.0, 90.0, 'Southwest France', 'Madiran', None, 'Tannat', 'Vignobles Brumont'),
 (15, 'US', "With its sophisticated mix of mineral, acid and tart fruits, this seductive effort pleases from start to finish. Supple and dense, it's got strawberr ... (129 characters truncated) ... proportion and finish with an appealing silky texture. It's delicious already, but give it another decade for full enjoyment. Drink now through 2028.", 95.0, 185.0, 'Oregon', 'Dundee Hills', 'Willamette Valley', 'Pinot Noir', 'Domaine Serene'),
 (16, 'US', "First made in 2006, this succulent luscious Chardonnay is all about minerality. It's got a rich core of butterscotch and the seemingly endless layers of subtle flavors that biodynamic farming can bring. It spends 18 months on the lees prior to bottling. Drink now through 2028.", 95.0, 90.0, 'Oregon', 'Willamette Valley', 'Willamette Valley', 'Chardonnay', 'Bergström'),
 (17, 'US', "This blockbuster, powerhouse of a wine suggests blueberry pie and chocolate as it opens in the glass. On the palate, it's smooth and seductively silky, offering complex cedar, peppercorn and peppery oak seasonings amidst its dense richness. It finishes with finesse and spice.", 95.0, 325.0, 'California', 'Diamond Mountain District', 'Napa', 'Cabernet Sauvignon', 'Hall'),
 (18, 'Spain', 'Nicely oaked blackberry, licorice, vanilla and charred aromas are smooth and sultry. This is an outstanding wine from an excellent year. Forward barr ... (40 characters truncated) ... ackberry and raspberry fruit, while this runs long and tastes vaguely chocolaty on the velvety finish. Enjoy this top-notch Tempranillo through 2030.', 95.0, 80.0, 'Northern Spain', 'Ribera del Duero', None, 'Tempranillo', 'Valduero'),
 (19, 'France', 'Coming from a seven-acre vineyard named after the dovecote on the property, this is a magnificent wine. Powered by both fruit tannins and the 28 mont ... (74 characters truncated) ...  sign of its pedigree, there is also elegance here, a restraint which is new to this wine. That makes it a wine for long-term aging. Drink from 2022.', 95.0, 290.0, 'Southwest France', 'Cahors', None, 'Malbec', 'Château Lagrézette'),
 (20, 'US', 'This fresh and lively medium-bodied wine is beautifully crafted, with cherry blossom aromas and tangy acidity. Layered and seductive, it offers a crisp mix of orange peel, cherry, pomegranate and baking spice flavors that are ready for the table or the cellar.', 95.0, 75.0, 'California', 'Sonoma Coast', 'Sonoma', 'Pinot Noir', 'Gary Farrell')]

# Data Engineering for Leaflet part

In [112]:
# Check for the unique countries 
new_df["country"].unique()

array(['US', 'Spain', 'France', 'Italy', 'New Zealand', 'Bulgaria',
       'Argentina', 'Australia', 'Portugal', 'Israel', 'South Africa',
       'Greece', 'Chile', 'Morocco', 'Romania', 'Germany', 'Canada',
       'Moldova', 'Hungary', 'Austria', 'Croatia', 'Slovenia', 'India',
       'Turkey', 'Macedonia', 'Lebanon', 'Serbia', 'Uruguay',
       'Switzerland', 'Albania', 'Bosnia and Herzegovina', 'Brazil',
       'Cyprus', 'Lithuania', 'Japan', 'China', 'South Korea', 'Ukraine',
       'England', 'Mexico', 'Georgia', 'Montenegro', 'Luxembourg',
       'Slovakia', 'Czech Republic', 'US-France'], dtype=object)

In [113]:
# Get the averages for each country 
map_data = new_df.groupby('country').agg({'points':'mean', 'price':'mean'})
map_data.head(2)

              points      price
country
Albania    88.000000  20.000000
Argentina  86.001074  20.794881

In [114]:
# Reset the index in order to convert df into a list of dictionaries
map_df = map_data.reset_index()
map_df.head(2)

     country     points      price
0    Albania  88.000000  20.000000
1  Argentina  86.001074  20.794881

In [115]:
# OpenCageGeocode
# Save API key in the variable 
key = "735fa8c57707473ab1e9c3742a4e9e2c"

In [116]:
# Assig the key 
geocoder = OpenCageGeocode(key)

In [117]:
# Create empty lists to save the results
list_lat = []   
list_long = []

# Iterate over rows in dataframe
for index, row in map_df.iterrows(): 

    Country = row['country']    
    query = str(Country)

    results = geocoder.geocode(query)   
    lat = results[0]['geometry']['lat']
    long = results[0]['geometry']['lng']

    list_lat.append(lat)
    list_long.append(long)

# Create new columns from lists    
map_df['lat'] = list_lat   
map_df['lon'] = list_long

map_df.head(2)

     country     points      price        lat        lon
0    Albania  88.000000  20.000000  41.000028  19.999962
1  Argentina  86.001074  20.794881 -34.996496 -64.967282

In [140]:
# Find the top 5 countries for qualities for the map visualization
map_df.sort_values(by=['points'], ascending = False)

                   country     points      price        lat         lon
13                 England  92.750000  47.500000  52.795479   -0.540240
3                  Austria  89.190898  31.192106  47.200034   13.199959
16                 Germany  88.610567  39.011078  51.083420   10.423447
14                  France  88.603314  45.619885  46.603354    1.888334
21                   Italy  88.445006  37.547913  42.638426   12.674297
7                   Canada  88.221649  34.628866  61.066692 -107.991707
32                Portugal  88.176724  26.332615  40.033263   -7.889626
36                Slovenia  88.172840  28.061728  45.813311   14.480837
30                 Morocco  88.166667  18.833333  31.172821   -7.336248
41                  Turkey  88.140000  25.800000  38.959759   34.924965
0                  Albania  88.000000  20.000000  41.000028   19.999962
43               US-France  88.000000  50.000000  45.082085    6.059645
2                Australia  87.881488  31.258480 -24.776109  134.755000
42                      US  87.817200  33.653808  39.783730 -100.445882
34                  Serbia  87.714286  24.285714  44.153412   20.551440
19                   India  87.625000  13.875000  22.351115   78.667743
31             New Zealand  87.542671  24.173290 -41.500083  172.834408
18                 Hungary  87.304348  44.204348  47.181759   19.506094
40             Switzerland  87.250000  26.500000  46.798562    8.231974
37            South Africa  87.211444  21.130532 -28.816624   24.991639
20                  Israel  87.155738  31.304918  30.876027   35.001520
25              Luxembourg  87.000000  40.666667  49.815868    6.129675
39                   Spain  86.638725  27.048529  39.326234   -4.838065
10                 Croatia  86.493976  23.108434  45.564344   17.011895
8                    Chile  86.298127  19.344780 -31.761336  -71.318770
17                  Greece  86.103211  21.747706  38.995368   21.987713
1                Argentina  86.001074  20.794881 -34.996496  -64.967282
11                  Cyprus  85.870968  15.483871  34.982302   33.145128
12          Czech Republic  85.833333  18.000000  49.816700   15.474954
23                 Lebanon  85.702703  25.432432  33.875063   35.843409
15                 Georgia  85.511628  18.581395  41.680971   44.028738
6                 Bulgaria  85.467532  11.545455  42.607397   25.485662
22                   Japan  85.000000  24.000000  36.574844  139.239418
33                 Romania  84.920863  16.395683  45.985213   24.685923
26               Macedonia  84.812500  15.312500  41.617121   21.716839
27                  Mexico  84.761905  29.095238  19.432601  -99.133342
4   Bosnia and Herzegovina  84.750000  12.750000  44.305348   17.596147
28                 Moldova  84.718310  15.366197  47.286747   28.511024
44                 Ukraine  84.600000  13.000000  49.487197   31.271832
45                 Uruguay  84.541176  25.847059 -32.875555  -56.020153
24               Lithuania  84.250000  10.000000  55.350000   23.750000
35                Slovakia  83.666667  15.333333  48.741152   19.452865
5                   Brazil  83.240000  19.920000 -10.333333  -53.200000
29              Montenegro  82.000000  10.000000  42.772849   19.240859
9                    China  82.000000  20.333333  35.000074  104.999927
38             South Korea  81.500000  13.500000  36.558191  127.940856

In [125]:
# drop any rows that lack lat/long data if any
df_geo = map_df.dropna(subset=['lat', 'lon'], axis=0, inplace=False)

print('We have {} geotagged rows'.format(len(df_geo)))
df_geo.tail()

We have 46 geotagged rows

      country     points      price        lat         lon
41     Turkey  88.140000  25.800000  38.959759   34.924965
42         US  87.817200  33.653808  39.783730 -100.445882
43  US-France  88.000000  50.000000  45.082085    6.059645
44    Ukraine  84.600000  13.000000  49.487197   31.271832
45    Uruguay  84.541176  25.847059 -32.875555  -56.020153

In [126]:
# Function to convert df to geoJson
def df_to_geojson(map_df, properties, lat='lat', lon='lon'):
    
    # create a new dict to contain geojson data, using geojson format
    geojson = {'type':'FeatureCollection', 'features':[]}
    
    # loop through each row in the dataframe and convert each row to geojson format
    for _, row in map_df.iterrows():
        
        # create a feature template to fill in
        feature = {'type':'Feature',
                   'properties':{},
                   'geometry':{'type':'Polygon',
                               'coordinates':[]}}
        
        # fill in the coordinates
        feature['geometry']['coordinates'] = [row[lon],row[lat]]
        
        # for each column, get the value and add it as a new feature property
        for prop in properties:
            feature['properties'][prop] = row[prop]
            
        # add this feature (aka, converted dataframe row) to the list of features inside our dict
        geojson['features'].append(feature)
    return geojson

In [127]:
# Save list of columns in var
useful_columns = ['country', 'points', 'price']

# Save df in geojson dict with properties
geojson_dict = df_to_geojson(df_geo, properties=useful_columns)

# Finally dump json
geojson_str = json.dumps(geojson_dict, indent=2)

In [128]:
# save the geojson result to a file
output_filename = 'wine.js'
with open(output_filename, 'w') as output_file:
    output_file.write('var dataset = {};'.format(geojson_str))
    
# how many features did we save to the geojson file?
print('{} geotagged features saved to file'.format(len(geojson_dict['features'])))

46 geotagged features saved to file

In [104]:
# convert df to list of dictionaries for json later on
country_list = map_df.to_dict('records')

# Upolad map data to sqlite db

In [46]:
# Creating a Class & table 
class Map_wine(Base):
    __tablename__ = 'map_wine_table'
    id = Column(Integer, primary_key=True)
    country = Column(String(255))
    points = Column(Float)
    price = Column(Float)
    lat = Column(Float)
    lon = Column(Float)

In [47]:
Base.metadata.create_all(conn)

In [48]:
# Transfer the data to sqlite table
map_df.to_sql(name='map_wine_table', con=conn, if_exists='append', index=False)

In [49]:
# Inspecting the Table to make sure the table is there
inspector = inspect(engine)
inspector.get_table_names()

['map_wine_table', 'wine_table']

In [50]:
# Checking the data 
engine.execute('SELECT * FROM map_wine_table LIMIT 20').fetchall()

[(1, 'Albania', 88.0, 20.0, 41.000028, 19.9999619),
 (2, 'Argentina', 86.00107392160372, 20.794880973688922, -34.9964963, -64.9672817),
 (3, 'Australia', 87.88148753575807, 31.258479771148345, -24.7761086, 134.755),
 (4, 'Austria', 89.19089810712848, 31.192106322996377, 47.2000338, 13.199959),
 (5, 'Bosnia and Herzegovina', 84.75, 12.75, 44.3053476, 17.5961467),
 (6, 'Brazil', 83.24, 19.92, -10.3333333, -53.2),
 (7, 'Bulgaria', 85.46753246753246, 11.545454545454545, 42.6073975, 25.4856617),
 (8, 'Canada', 88.22164948453609, 34.628865979381445, 61.0666922, -107.9917071),
 (9, 'Chile', 86.29812695109261, 19.344779743322928, -31.7613365, -71.3187697),
 (10, 'China', 82.0, 20.333333333333332, 35.000074, 104.999927),
 (11, 'Croatia', 86.49397590361446, 23.10843373493976, 45.5643442, 17.0118954),
 (12, 'Cyprus', 85.87096774193549, 15.483870967741936, 34.9823018, 33.1451285),
 (13, 'Czech Republic', 85.83333333333333, 18.0, 49.8167003, 15.4749544),
 (14, 'England', 92.75, 47.5, 52.7954791, -0.5402403),
 (15, 'France', 88.60331416976666, 45.61988501859993, 46.603354, 1.8883335),
 (16, 'Georgia', 85.51162790697674, 18.58139534883721, 41.6809707, 44.0287382),
 (17, 'Germany', 88.6105666808692, 39.011077971879, 51.0834196, 10.4234469),
 (18, 'Greece', 86.10321100917432, 21.74770642201835, 38.9953683, 21.9877132),
 (19, 'Hungary', 87.30434782608695, 44.20434782608696, 47.1817585, 19.5060937),
 (20, 'India', 87.625, 13.875, 22.3511148, 78.6677428)]